In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (1.4.3)

[notice] A new release of pip available: 22.2.2 -> 22.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.2.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.23.2)
Requirement already satisfied: six>=1.5 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

#  Series

In [4]:
pd.Series(data=[1,2,3,4],index=["a","b","c","d"])

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
#with Dictonireis
myD={"e":20,"d":30,"f":40,"g":50}
myD

{'e': 20, 'd': 30, 'f': 40, 'g': 50}

In [7]:
pd.Series(myD)

e    20
d    30
f    40
g    50
dtype: int64

In [8]:
s1=pd.Series(data=[1,2,3,4],index=["a","b","c","d"])

In [9]:
s2=pd.Series(data=[1,2,3,4],index=["a","z","c","r"])

In [10]:
s1+s2

a    2.0
b    NaN
c    6.0
d    NaN
r    NaN
z    NaN
dtype: float64

#  DataFrames

In [11]:
from numpy.random import randn

In [12]:
md=randn(3,4)
md

array([[ 0.66895191, -0.50420331,  0.4616538 , -0.20937133],
       [-1.97942829, -0.39214583, -0.01008031,  0.51391183],
       [ 0.37405777, -0.6318854 ,  0.0061917 ,  1.15256324]])

In [13]:
df=pd.DataFrame(md,["R1","R2","R3"],["C1","C2","C3","C4"])
df

          C1        C2        C3        C4
R1  0.668952 -0.504203  0.461654 -0.209371
R2 -1.979428 -0.392146 -0.010080  0.513912
R3  0.374058 -0.631885  0.006192  1.152563

In [18]:
df['C1']

R1    0.668952
R2   -1.979428
R3    0.374058
Name: C1, dtype: float64

In [22]:
df[['C1','C2']]

          C1        C2
R1  0.668952 -0.504203
R2 -1.979428 -0.392146
R3  0.374058 -0.631885

In [23]:
df['C5']=df['C1']*df['C3']

In [24]:
df

          C1        C2        C3        C4        C5
R1  0.668952 -0.504203  0.461654 -0.209371  0.308824
R2 -1.979428 -0.392146 -0.010080  0.513912  0.019953
R3  0.374058 -0.631885  0.006192  1.152563  0.002316

In [25]:
df.drop('C5',axis=1)

          C1        C2        C3        C4
R1  0.668952 -0.504203  0.461654 -0.209371
R2 -1.979428 -0.392146 -0.010080  0.513912
R3  0.374058 -0.631885  0.006192  1.152563

In [26]:
df

          C1        C2        C3        C4        C5
R1  0.668952 -0.504203  0.461654 -0.209371  0.308824
R2 -1.979428 -0.392146 -0.010080  0.513912  0.019953
R3  0.374058 -0.631885  0.006192  1.152563  0.002316

In [27]:
df.drop('C5',axis=1,inplace=True)

In [28]:
df

          C1        C2        C3        C4
R1  0.668952 -0.504203  0.461654 -0.209371
R2 -1.979428 -0.392146 -0.010080  0.513912
R3  0.374058 -0.631885  0.006192  1.152563

# Subselection Using Pandas

In [29]:
df.loc['R2']

C1   -1.979428
C2   -0.392146
C3   -0.010080
C4    0.513912
Name: R2, dtype: float64

In [31]:
df.iloc[1]

C1   -1.979428
C2   -0.392146
C3   -0.010080
C4    0.513912
Name: R2, dtype: float64

In [ ]:
df.loc[["R1",""]]